# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Import Datasets

In [2]:
path=(r'C:\Users\Admin\Desktop\Data Tasks\Data Immersion\Achievement 4\Instacart Basket Analysis\02 data')

In [3]:
#importing customers dataset
df_cust=pd.read_csv(os.path.join(path,'Original Data','customers.csv'))

In [4]:
#importing ord_prods_merged
ords_prods_merge=pd.read_pickle(os.path.join(path,'Prepared Data','ords_prods_merge_frequency_flags.pkl'))

# Direction 4
#### Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

In [5]:
#displaying df_cust 
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

##### Note: all the values look reasonable

In [7]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [8]:
df_cust.shape

(206209, 10)

## Data Wrangling

### Rename Columns

In [9]:
#renaming columns for consistancy
new_column_names={'Gender':'gender',
                 'STATE':'state',
                 'Age':'age'}
df_cust.rename(columns=new_column_names,inplace=True)

In [10]:
#checking the renamed columns
df_cust.columns

Index(['user_id', 'First Name', 'Surnam', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

### Change Data Type

In [11]:
df_cust['user_id']=df_cust['user_id'].astype('str')

### Dropping Columns

##### Name and surname columns will be dropped as they are not crucial for analysis, if needed the names can be searched in customers dataframe. If dropped the memory usage of the merged dataframes will dicrease.

In [12]:
df_cust_name_drop=df_cust.drop(columns=['First Name','Surnam'])
df_cust_name_drop

,user_id,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

# Direction 5
#### Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

## Mixed-type Data

In [13]:
for col in df_cust_name_drop.columns.tolist():
  weird = (df_cust_name_drop[[col]].applymap(type) != df_cust_name_drop[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust_name_drop[weird]) > 0:
    print (col)

## Missing values

In [14]:
df_cust_name_drop.isnull().sum()

user_id         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

##### Well, this is a pleasant view now!

## Duplicates

In [15]:
df_dups = df_cust[df_cust.duplicated()]

##### No duplicates in the sight

# Side note: before moving on with the next direction,firstly, I will handle the extreme values in the 'prices' column in the ord_prod_merge dataframe

In [16]:
#finding the values that are too big to be valid prices in the suparmarket
ords_prods_merge[['product_name','prices']].loc[ords_prods_merge['prices']>100]

                              product_name   prices
10030345  Lowfat 2% Milkfat Cottage Cheese  14900.0
10030346  Lowfat 2% Milkfat Cottage Cheese  14900.0
10030347  Lowfat 2% Milkfat Cottage Cheese  14900.0
10030348  Lowfat 2% Milkfat Cottage Cheese  14900.0
10030349  Lowfat 2% Milkfat Cottage Cheese  14900.0
...                                    ...      ...
29166209             2 % Reduced Fat  Milk  99999.0
29166210             2 % Reduced Fat  Milk  99999.0
29166211             2 % Reduced Fat  Milk  99999.0
29166212             2 % Reduced Fat  Milk  99999.0
29166213             2 % Reduced Fat  Milk  99999.0

[5127 rows x 2 columns]

In [17]:
#checking all the possible products with unrealistic prices
ords_prods_merge[['product_name','prices']].loc[ords_prods_merge['prices']>100].value_counts()

product_name                      prices
Lowfat 2% Milkfat Cottage Cheese  14900.0    4429
2 % Reduced Fat  Milk             99999.0     698
Name: count, dtype: int64

In [18]:
#changing the extreme values to NaN
ords_prods_merge.loc[ords_prods_merge['prices']>100,'prices']=np.nan

In [19]:
ords_prods_merge['prices'].max()

25.0

# Direction 
#### Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [20]:
df_cust_name_drop.columns

Index(['user_id', 'gender', 'state', 'age', 'date_joined', 'n_dependants',
       'fam_status', 'income'],
      dtype='object')

In [21]:
ords_prods_merge.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_label', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'prices_mean',
       'spending_flag', 'order_median', 'frequency_flag'],
      dtype='object')

In [22]:
ords_prods_merge['user_id'].dtype

dtype('int32')

In [23]:
ords_prods_merge['user_id']=ords_prods_merge['user_id'].astype('str')

In [24]:
#combining df_cust with ords_prods_merge on key column user_id
df_ords_prods_cust=ords_prods_merge.merge(df_cust_name_drop,on=['user_id'],indicator=True)

In [25]:
df_ords_prods_cust.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_median,frequency_flag,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423,both

In [26]:
df_ords_prods_cust['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [27]:
df_ords_prods_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 30 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 object
 2   order_number            int8
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   product_id              int32
 7   add_to_cart_order       int32
 8   reordered               int8
 9   product_name            object
 10  aisle_id                int16
 11  department_id           int8
 12  prices                  float32
 13  price_label             object
 14  busiest_days            object
 15  busiest_period_of_day   object
 16  max_order               int8
 17  loyalty_flag            object
 18  prices_mean             float32
 19  spending_flag           object
 20  order_median            float16
 21  frequency_flag          object
 22  gender                  object
 23  state                   object
 24  age                     int64
 25  date_joined             object
 26  n_dependants            int64
 27  fam_status              object
 28  income                  int64
 29  _merge                  category
dtypes: category(1), float16(2), float32(2), int16(1), int32(3), int64(3), int8(6), object(12)
memory usage: 4.6+ GB

In [28]:
#we can drop _merge column
df_ords_prods_cust=df_ords_prods_cust.drop(columns=['_merge'])

# Direction 8
#### Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [29]:
df_ords_prods_cust.to_pickle(os.path.join(path,'Prepared Data','df_ords_prods_cust_merged.pkl'))